'use strict';

// let admin;

// let name;

// name = 'Джон';

// admin = name;

// alert(admin);


// const ourPlanetName = 'Earth';

// let currentUserName = 'Михаил';


// const BIRTHDAY = '18.04.1982';
//Можно использовать загланые буквы в данном примере, но если пользователь будет сам вводить это значение, тогда нельзя.

// const AGE = someCode(BIRTHDAY);
//Нельзя, т.к. возраст будет вычисляться при помощи функции и через год (два и т.п) текущий возраст изменится, а значит функция потом снова отработает и получит другое значение